# ICodeCheckingParameterServer Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ICodeCheckingParameterServer Methods
ICodeCheckingParameterServer Interface See Also
---
The ICodeCheckingParameterServer type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetDescription | Implement this method to return a description of the server.  (Inherited from IExternalServer.) |
| GetName | Implement this method to return the name of the server.  (Inherited from IExternalServer.) |
| GetServerId | Implement this method to return the id of the server.  (Inherited from IExternalServer.) |
| GetServiceId | Implement this method to return the id of the service.  (Inherited from IExternalServer.) |
| GetVendorId | Implement this method to return the id of the vendor of the server.  (Inherited from IExternalServer.) |
| PerformCodeChecking | The server's method that will be called when Revit User clicks the Code Checking parameter's button from the properties palette. |

# See Also
ICodeCheckingParameterServer Interface
Autodesk.Revit.DB.Structure Namespace